tap "nikitabobko/tap" # Aerospace
tap "jorgerojas26/lazysql" 

# CLI Tools
brew "git"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "lazygit"
brew "lazysql"
brew "awscli"
brew "jq"
brew "yq"
brew "gh"
brew "delta"
brew "tmux"
brew "stow"
brew "neovim"
brew "kubectl"       # Kubernetes CLI
brew "tailscale"     # Secure mesh VPN for homelab and remote access
brew "diff-so-fancy"

# Languages n stuff
brew "python"
brew "pipx"
brew "node"
brew "nvm"

# GNU Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# GUI Applications
cask "iterm2"
cask "visual-studio-code"
cask "raycast"
cask "docker"
cask "ghostty"
cask "aerospace"
cask "caffeine"
cask "discord"
cask "chatgpt"
cask "shottr"
cask "caffeine"
cask "claude"
cask "firefox"
cask "bartender"
cask "claude-code"
cask "google-chrome"
cask "evernote"
cask "zoom"
cask "arduino-ide"
cask "atext"
cask "dropbox"
# cask "sequel-ace" # mysql client
# cask "copyclip" # install using app store

# Fonts
cask "font-jetbrains-mono-nerd-font"

